alpellegri/cc1101/esp32/lib/eSPI/esp32-hal-espi.c
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "esp32-hal-espi.h"
#include "esp32-hal.h"
#include "esp_attr.h"
#include "esp_intr.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "rom/ets_sys.h"
#include "rom/gpio.h"
#include "soc/dport_reg.h"
#include "soc/gpio_sig_map.h"
#include "soc/io_mux_reg.h"
#include "soc/spi_reg.h"
#include "soc/spi_struct.h"

#define SPI_CLK_IDX(p)                                                         \
  ((p == 0) ? SPICLK_OUT_IDX                                                   \
            : ((p == 1) ? SPICLK_OUT_IDX                                       \
                        : ((p == 2) ? HSPICLK_OUT_IDX                          \
                                    : ((p == 3) ? VSPICLK_OUT_IDX : 0))))
#define SPI_MISO_IDX(p)                                                        \
  ((p == 0) ? SPIQ_OUT_IDX                                                     \
            : ((p == 1) ? SPIQ_OUT_IDX                                         \
                        : ((p == 2) ? HSPIQ_OUT_IDX                            \
                                    : ((p == 3) ? VSPIQ_OUT_IDX : 0))))
#define SPI_MOSI_IDX(p)                                                        \
  ((p == 0) ? SPID_IN_IDX                                                      \
            : ((p == 1) ? SPID_IN_IDX                                          \
                        : ((p == 2) ? HSPID_IN_IDX                             \
                                    : ((p == 3) ? VSPID_IN_IDX : 0))))

#define SPI_SPI_SS_IDX(n)                                                      \
  ((n == 0) ? SPICS0_OUT_IDX                                                   \
            : ((n == 1) ? SPICS1_OUT_IDX                                       \
                        : ((n == 2) ? SPICS2_OUT_IDX : SPICS0_OUT_IDX)))
#define SPI_HSPI_SS_IDX(n)                                                     \
  ((n == 0) ? HSPICS0_OUT_IDX                                                  \
            : ((n == 1) ? HSPICS1_OUT_IDX                                      \
                        : ((n == 2) ? HSPICS2_OUT_IDX : HSPICS0_OUT_IDX)))
#define SPI_VSPI_SS_IDX(n)                                                     \
  ((n == 0) ? VSPICS0_OUT_IDX                                                  \
            : ((n == 1) ? VSPICS1_OUT_IDX                                      \
                        : ((n == 2) ? VSPICS2_OUT_IDX : VSPICS0_OUT_IDX)))
#define SPI_SS_IDX(p, n)                                                       \
  ((p == 0) ? SPI_SPI_SS_IDX(n)                                                \
            : ((p == 1) ? SPI_SPI_SS_IDX(n)                                    \
                        : ((p == 2) ? SPI_HSPI_SS_IDX(n)                       \
                                    : ((p == 3) ? SPI_VSPI_SS_IDX(n) : 0))))

#define SPI_INUM(u) (2)
#define SPI_INTR_SOURCE(u)                                                     \
  ((u == 0) ? ETS_SPI0_INTR_SOURCE                                             \
            : ((u == 1) ? ETS_SPI1_INTR_SOURCE                                 \
                        : ((u == 2) ? ETS_SPI2_INTR_SOURCE                     \
                                    : ((p == 3) ? ETS_SPI3_INTR_SOURCE : 0))))

struct spi_struct_t {
  spi_dev_t *dev;
#if !CONFIG_DISABLE_HAL_LOCKS
  xSemaphoreHandle lock;
#endif
  uint8_t num;
};

#if CONFIG_DISABLE_HAL_LOCKS
#define SPI_MUTEX_LOCK()
#define SPI_MUTEX_UNLOCK()

static espi_t _spi_bus_array[4] = {
    {(volatile spi_dev_t *)(DR_REG_SPI0_BASE), 0},
    {(volatile spi_dev_t *)(DR_REG_SPI1_BASE), 1},
    {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), 2},
    {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), 3}};
#else
#define SPI_MUTEX_LOCK()                                                       \
  do {                                                                         \
  } while (xSemaphoreTake(spi->lock, portMAX_DELAY) != pdPASS)
#define SPI_MUTEX_UNLOCK() xSemaphoreGive(spi->lock)

static espi_t _spi_bus_array[4] = {
    {(volatile spi_dev_t *)(DR_REG_SPI0_BASE), NULL, 0},
    {(volatile spi_dev_t *)(DR_REG_SPI1_BASE), NULL, 1},
    {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 2},
    {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), NULL, 3}};
#endif

void espiAttachSCK(espi_t *spi, int8_t sck) {
  if (!spi) {
    return;
  }
  if (sck < 0) {
    if (spi->num == HSPI) {
      sck = 14;
    } else if (spi->num == VSPI) {
      sck = 18;
    } else {
      sck = 6;
    }
  }
  pinMode(sck, OUTPUT);
  pinMatrixOutAttach(sck, SPI_CLK_IDX(spi->num), false, false);
}

void espiAttachMISO(espi_t *spi, int8_t miso) {
  if (!spi) {
    return;
  }
  if (miso < 0) {
    if (spi->num == HSPI) {
      miso = 12;
    } else if (spi->num == VSPI) {
      miso = 19;
    } else {
      miso = 7;
    }
  }
  SPI_MUTEX_LOCK();
  pinMode(miso, INPUT);
  pinMatrixInAttach(miso, SPI_MISO_IDX(spi->num), false);
  SPI_MUTEX_UNLOCK();
}

void espiAttachMOSI(espi_t *spi, int8_t mosi) {
  if (!spi) {
    return;
  }
  if (mosi < 0) {
    if (spi->num == HSPI) {
      mosi = 13;
    } else if (spi->num == VSPI) {
      mosi = 23;
    } else {
      mosi = 8;
    }
  }
  pinMode(mosi, OUTPUT);
  pinMatrixOutAttach(mosi, SPI_MOSI_IDX(spi->num), false, false);
}

void espiDetachSCK(espi_t *spi, int8_t sck) {
  if (!spi) {
    return;
  }
  if (sck < 0) {
    if (spi->num == HSPI) {
      sck = 14;
    } else if (spi->num == VSPI) {
      sck = 18;
    } else {
      sck = 6;
    }
  }
  pinMatrixOutDetach(sck, false, false);
  pinMode(sck, INPUT);
}

void espiDetachMISO(espi_t *spi, int8_t miso) {
  if (!spi) {
    return;
  }
  if (miso < 0) {
    if (spi->num == HSPI) {
      miso = 12;
    } else if (spi->num == VSPI) {
      miso = 19;
    } else {
      miso = 7;
    }
  }
  pinMatrixInDetach(SPI_MISO_IDX(spi->num), false, false);
  pinMode(miso, INPUT);
}

void espiDetachMOSI(espi_t *spi, int8_t mosi) {
  if (!spi) {
    return;
  }
  if (mosi < 0) {
    if (spi->num == HSPI) {
      mosi = 13;
    } else if (spi->num == VSPI) {
      mosi = 23;
    } else {
      mosi = 8;
    }
  }
  pinMatrixOutDetach(mosi, false, false);
  pinMode(mosi, INPUT);
}

void espiAttachSS(espi_t *spi, uint8_t cs_num, int8_t ss) {
  if (!spi) {
    return;
  }
  if (cs_num > 2) {
    return;
  }
  if (ss < 0) {
    cs_num = 0;
    if (spi->num == HSPI) {
      ss = 15;
    } else if (spi->num == VSPI) {
      ss = 5;
    } else {
      ss = 11;
    }
  }
  pinMode(ss, OUTPUT);
  pinMatrixOutAttach(ss, SPI_SS_IDX(spi->num, cs_num), false, false);
  spiEnableSSPins(spi, (1 << cs_num));
}

