alpellegri/cc1101/esp32/lib/eSPI/esp32-hal-espi.c
void espiDetachSS(espi_t *spi, int8_t ss) {
  if (!spi) {
    return;
  }
  if (ss < 0) {
    if (spi->num == HSPI) {
      ss = 15;
    } else if (spi->num == VSPI) {
      ss = 5;
    } else {
      ss = 11;
    }
  }
  pinMatrixOutDetach(ss, false, false);
  pinMode(ss, INPUT);
}

void espiEnableSSPins(espi_t *spi, uint8_t cs_mask) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->pin.val &= ~(cs_mask & SPI_CS_MASK_ALL);
  SPI_MUTEX_UNLOCK();
}

void espiDisableSSPins(espi_t *spi, uint8_t cs_mask) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->pin.val |= (cs_mask & SPI_CS_MASK_ALL);
  SPI_MUTEX_UNLOCK();
}

void espiSSEnable(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->user.cs_setup = 1;
  spi->dev->user.cs_hold = 1;
  SPI_MUTEX_UNLOCK();
}

void espiSSDisable(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->user.cs_setup = 0;
  spi->dev->user.cs_hold = 0;
  SPI_MUTEX_UNLOCK();
}

void espiSSSet(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->pin.cs_keep_active = 1;
  SPI_MUTEX_UNLOCK();
}

void espiSSClear(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->pin.cs_keep_active = 0;
  SPI_MUTEX_UNLOCK();
}

uint32_t espiGetClockDiv(espi_t *spi) {
  if (!spi) {
    return 0;
  }
  return spi->dev->clock.val;
}

void espiSetClockDiv(espi_t *spi, uint32_t clockDiv) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->clock.val = clockDiv;
  SPI_MUTEX_UNLOCK();
}

uint8_t espiGetDataMode(espi_t *spi) {
  if (!spi) {
    return 0;
  }
  bool idleEdge = spi->dev->pin.ck_idle_edge;
  bool outEdge = spi->dev->user.ck_out_edge;
  if (idleEdge) {
    if (outEdge) {
      return SPI_MODE2;
    }
    return SPI_MODE3;
  }
  if (outEdge) {
    return SPI_MODE1;
  }
  return SPI_MODE0;
}

void espiSetDataMode(espi_t *spi, uint8_t dataMode) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  switch (dataMode) {
  case ESPI_MODE1:
    spi->dev->pin.ck_idle_edge = 0;
    spi->dev->user.ck_out_edge = 1;
    break;
  case ESPI_MODE2:
    spi->dev->pin.ck_idle_edge = 1;
    spi->dev->user.ck_out_edge = 1;
    break;
  case ESPI_MODE3:
    spi->dev->pin.ck_idle_edge = 1;
    spi->dev->user.ck_out_edge = 0;
    break;
  case ESPI_MODE0:
  default:
    spi->dev->pin.ck_idle_edge = 0;
    spi->dev->user.ck_out_edge = 0;
    break;
  }
  SPI_MUTEX_UNLOCK();
}

uint8_t espiGetBitOrder(espi_t *spi) {
  if (!spi) {
    return 0;
  }
  return (spi->dev->ctrl.wr_bit_order | spi->dev->ctrl.rd_bit_order) == 0;
}

void espiSetBitOrder(espi_t *spi, uint8_t bitOrder) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  if (ESPI_MSBFIRST == bitOrder) {
    spi->dev->ctrl.wr_bit_order = 0;
    spi->dev->ctrl.rd_bit_order = 0;
  } else if (ESPI_LSBFIRST == bitOrder) {
    spi->dev->ctrl.wr_bit_order = 1;
    spi->dev->ctrl.rd_bit_order = 1;
  }
  SPI_MUTEX_UNLOCK();
}

void espiStopBus(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->slave.trans_done = 0;
  spi->dev->slave.slave_mode = 0;
  spi->dev->pin.val = 0;
  spi->dev->user.val = 0;
  spi->dev->user1.val = 0;
  spi->dev->ctrl.val = 0;
  spi->dev->ctrl1.val = 0;
  spi->dev->ctrl2.val = 0;
  spi->dev->clock.val = 0;
  SPI_MUTEX_UNLOCK();
}

espi_t *espiStartBus(uint8_t spi_num, uint32_t clockDiv, uint8_t dataMode,
                    uint8_t bitOrder) {
  if (spi_num > 3) {
    return NULL;
  }

  espi_t *spi = &_spi_bus_array[spi_num];

#if !CONFIG_DISABLE_HAL_LOCKS
  if (spi->lock == NULL) {
    spi->lock = xSemaphoreCreateMutex();
    if (spi->lock == NULL) {
      return NULL;
    }
  }
#endif

  if (spi_num == HSPI) {
    DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI_CLK_EN);
    DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI_RST);
  } else if (spi_num == VSPI) {
    DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI_CLK_EN_2);
    DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI_RST_2);
  } else {
    DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI_CLK_EN_1);
    DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI_RST_1);
  }

  espiStopBus(spi);
  espiSetDataMode(spi, dataMode);
  espiSetBitOrder(spi, bitOrder);
  espiSetClockDiv(spi, clockDiv);

  SPI_MUTEX_LOCK();
  spi->dev->user.usr_mosi = 1;
  spi->dev->user.usr_miso = 1;
  spi->dev->user.doutdin = 1;

  int i;
  for (i = 0; i < 16; i++) {
    spi->dev->data_buf[i] = 0x00000000;
  }
  SPI_MUTEX_UNLOCK();

  return spi;
}

void espiWaitReady(espi_t *spi) {
  if (!spi) {
    return;
  }
  while (spi->dev->cmd.usr)
    ;
}

void espiWrite(espi_t *spi, uint32_t *data, uint8_t len) {
  if (!spi) {
    return;
  }
  int i;
  if (len > 16) {
    len = 16;
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = (len * 32) - 1;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  for (i = 0; i < len; i++) {
    spi->dev->data_buf[i] = data[i];
  }
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  SPI_MUTEX_UNLOCK();
}

void espiTransfer(espi_t *spi, uint32_t *data, uint8_t len) {
  if (!spi) {
    return;
  }
  int i;
  if (len > 16) {
    len = 16;
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = (len * 32) - 1;
  spi->dev->miso_dlen.usr_miso_dbitlen = (len * 32) - 1;
  for (i = 0; i < len; i++) {
    spi->dev->data_buf[i] = data[i];
  }
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  for (i = 0; i < len; i++) {
    data[i] = spi->dev->data_buf[i];
  }
  SPI_MUTEX_UNLOCK();
}

uint8_t espiRead(espi_t *spi) {
  return spi->dev->data_buf[0] & 0xFF;
}

void espiWriteByte(espi_t *spi, uint8_t data) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 7;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  SPI_MUTEX_UNLOCK();
}

uint8_t espiTransferByte(espi_t *spi, uint8_t data) {
  if (!spi) {
    return 0;
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 7;
  spi->dev->miso_dlen.usr_miso_dbitlen = 7;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0] & 0xFF;
  SPI_MUTEX_UNLOCK();
  return data;
}

uint32_t __espiTranslate24(uint32_t data) {
  union {
    uint32_t l;
    uint8_t b[4];
  } out;
  out.l = data;
  return out.b[2] | (out.b[1] << 8) | (out.b[0] << 16);
}

uint32_t __espiTranslate32(uint32_t data) {
  union {
    uint32_t l;
    uint8_t b[4];
  } out;
  out.l = data;
  return out.b[3] | (out.b[2] << 8) | (out.b[1] << 16) | (out.b[0] << 24);
}

void espiWriteWord(espi_t *spi, uint16_t data) {
  if (!spi) {
    return;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    data = (data >> 8) | (data << 8);
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  SPI_MUTEX_UNLOCK();
}

uint16_t espiTransferWord(espi_t *spi, uint16_t data) {
  if (!spi) {
    return 0;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    data = (data >> 8) | (data << 8);
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
  spi->dev->miso_dlen.usr_miso_dbitlen = 15;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0];
  SPI_MUTEX_UNLOCK();
  if (!spi->dev->ctrl.rd_bit_order) {
    data = (data >> 8) | (data << 8);
  }
  return data;
}

void espiWriteLong(espi_t *spi, uint32_t data) {
  if (!spi) {
    return;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    data = __espiTranslate32(data);
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 31;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  SPI_MUTEX_UNLOCK();
}

