alpellegri/cc1101/esp32/lib/eSPI/esp32-hal-espi.c
uint32_t espiTransferLong(espi_t *spi, uint32_t data) {
  if (!spi) {
    return 0;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    data = __espiTranslate32(data);
  }
  SPI_MUTEX_LOCK();
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 31;
  spi->dev->miso_dlen.usr_miso_dbitlen = 31;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0];
  SPI_MUTEX_UNLOCK();
  if (!spi->dev->ctrl.rd_bit_order) {
    data = __espiTranslate32(data);
  }
  return data;
}

void __espiTransferBytes(espi_t *spi, uint8_t *data, uint8_t *out,
                        uint32_t bytes) {
  if (!spi) {
    return;
  }
  int i;

  if (bytes > 64) {
    bytes = 64;
  }

  uint32_t words = (bytes + 3) / 4; // 16 max

  uint32_t wordsBuf[16] = {
      0,
  };
  uint8_t *bytesBuf = (uint8_t *)wordsBuf;

  if (data) {
    memcpy(bytesBuf, data, bytes); // copy data to buffer
  } else {
    memset(bytesBuf, 0xFF, bytes);
  }

  spi->dev->mosi_dlen.usr_mosi_dbitlen = ((bytes * 8) - 1);
  spi->dev->miso_dlen.usr_miso_dbitlen = ((bytes * 8) - 1);

  for (i = 0; i < words; i++) {
    spi->dev->data_buf[i] = wordsBuf[i]; // copy buffer to spi fifo
  }

  spi->dev->cmd.usr = 1;

  while (spi->dev->cmd.usr)
    ;

  if (out) {
    for (i = 0; i < words; i++) {
      wordsBuf[i] = spi->dev->data_buf[i]; // copy spi fifo to buffer
    }
    memcpy(out, bytesBuf, bytes); // copy buffer to output
  }
}

void espiTransferBytes(espi_t *spi, uint8_t *data, uint8_t *out, uint32_t size) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  while (size) {
    if (size > 64) {
      __espiTransferBytes(spi, data, out, 64);
      size -= 64;
      if (data) {
        data += 64;
      }
      if (out) {
        out += 64;
      }
    } else {
      __espiTransferBytes(spi, data, out, size);
      size = 0;
    }
  }
  SPI_MUTEX_UNLOCK();
}

void espiTransferBits(espi_t *spi, uint32_t data, uint32_t *out, uint8_t bits) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spiTransferBitsNL(spi, data, out, bits);
  SPI_MUTEX_UNLOCK();
}

  /*
   * Manual Lock Management
   * */

#define MSB_32_SET(var, val)                                                   \
  {                                                                            \
    uint8_t *d = (uint8_t *)&(val);                                            \
    (var) = d[3] | (d[2] << 8) | (d[1] << 16) | (d[0] << 24);                  \
  }
#define MSB_24_SET(var, val)                                                   \
  {                                                                            \
    uint8_t *d = (uint8_t *)&(val);                                            \
    (var) = d[2] | (d[1] << 8) | (d[0] << 16);                                 \
  }
#define MSB_16_SET(var, val)                                                   \
  { (var) = (((val)&0xFF00) >> 8) | (((val)&0xFF) << 8); }
#define MSB_PIX_SET(var, val)                                                  \
  {                                                                            \
    uint8_t *d = (uint8_t *)&(val);                                            \
    (var) = d[1] | (d[0] << 8) | (d[3] << 16) | (d[2] << 24);                  \
  }

void espiTransaction(espi_t *spi, uint32_t clockDiv, uint8_t dataMode,
                    uint8_t bitOrder) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
  spi->dev->clock.val = clockDiv;
  switch (dataMode) {
  case ESPI_MODE1:
    spi->dev->pin.ck_idle_edge = 0;
    spi->dev->user.ck_out_edge = 1;
    break;
  case ESPI_MODE2:
    spi->dev->pin.ck_idle_edge = 1;
    spi->dev->user.ck_out_edge = 1;
    break;
  case ESPI_MODE3:
    spi->dev->pin.ck_idle_edge = 1;
    spi->dev->user.ck_out_edge = 0;
    break;
  case ESPI_MODE0:
  default:
    spi->dev->pin.ck_idle_edge = 0;
    spi->dev->user.ck_out_edge = 0;
    break;
  }
  if (ESPI_MSBFIRST == bitOrder) {
    spi->dev->ctrl.wr_bit_order = 0;
    spi->dev->ctrl.rd_bit_order = 0;
  } else if (ESPI_LSBFIRST == bitOrder) {
    spi->dev->ctrl.wr_bit_order = 1;
    spi->dev->ctrl.rd_bit_order = 1;
  }
}

void espiSimpleTransaction(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_LOCK();
}

void espiEndTransaction(espi_t *spi) {
  if (!spi) {
    return;
  }
  SPI_MUTEX_UNLOCK();
}

void espiWriteByteNL(espi_t *spi, uint8_t data) {
  if (!spi) {
    return;
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 7;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
}

uint8_t espiTransferByteNL(espi_t *spi, uint8_t data) {
  if (!spi) {
    return 0;
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 7;
  spi->dev->miso_dlen.usr_miso_dbitlen = 7;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0] & 0xFF;
  return data;
}

void espiWriteShortNL(espi_t *spi, uint16_t data) {
  if (!spi) {
    return;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    MSB_16_SET(data, data);
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
}

uint16_t espiTransferShortNL(espi_t *spi, uint16_t data) {
  if (!spi) {
    return 0;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    MSB_16_SET(data, data);
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
  spi->dev->miso_dlen.usr_miso_dbitlen = 15;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0] & 0xFFFF;
  if (!spi->dev->ctrl.rd_bit_order) {
    MSB_16_SET(data, data);
  }
  return data;
}

void espiWriteLongNL(espi_t *spi, uint32_t data) {
  if (!spi) {
    return;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    MSB_32_SET(data, data);
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 31;
  spi->dev->miso_dlen.usr_miso_dbitlen = 0;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
}

uint32_t espiTransferLongNL(espi_t *spi, uint32_t data) {
  if (!spi) {
    return 0;
  }
  if (!spi->dev->ctrl.wr_bit_order) {
    MSB_32_SET(data, data);
  }
  spi->dev->mosi_dlen.usr_mosi_dbitlen = 31;
  spi->dev->miso_dlen.usr_miso_dbitlen = 31;
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0];
  if (!spi->dev->ctrl.rd_bit_order) {
    MSB_32_SET(data, data);
  }
  return data;
}

