alpellegri/cc1101/esp32/lib/eSPI/esp32-hal-espi.c
void espiWriteNL(espi_t *spi, const void *data_in, size_t len) {
  size_t longs = len >> 2;
  if (len & 3) {
    longs++;
  }
  uint32_t *data = (uint32_t *)data_in;
  size_t c_len = 0, c_longs = 0;

  while (len) {
    c_len = (len > 64) ? 64 : len;
    c_longs = (longs > 16) ? 16 : longs;

    spi->dev->mosi_dlen.usr_mosi_dbitlen = (c_len * 8) - 1;
    spi->dev->miso_dlen.usr_miso_dbitlen = 0;
    for (int i = 0; i < c_longs; i++) {
      spi->dev->data_buf[i] = data[i];
    }
    spi->dev->cmd.usr = 1;
    while (spi->dev->cmd.usr)
      ;

    data += c_longs;
    longs -= c_longs;
    len -= c_len;
  }
}

void espiTransferBytesNL(espi_t *spi, const void *data_in, uint8_t *data_out,
                        size_t len) {
  if (!spi) {
    return;
  }
  size_t longs = len >> 2;
  if (len & 3) {
    longs++;
  }
  uint32_t *data = (uint32_t *)data_in;
  uint32_t *result = (uint32_t *)data_out;
  size_t c_len = 0, c_longs = 0;

  while (len) {
    c_len = (len > 64) ? 64 : len;
    c_longs = (longs > 16) ? 16 : longs;

    spi->dev->mosi_dlen.usr_mosi_dbitlen = (c_len * 8) - 1;
    spi->dev->miso_dlen.usr_miso_dbitlen = (c_len * 8) - 1;
    if (data) {
      for (int i = 0; i < c_longs; i++) {
        spi->dev->data_buf[i] = data[i];
      }
    } else {
      for (int i = 0; i < c_longs; i++) {
        spi->dev->data_buf[i] = 0xFFFFFFFF;
      }
    }
    spi->dev->cmd.usr = 1;
    while (spi->dev->cmd.usr)
      ;
    if (result) {
      for (int i = 0; i < c_longs; i++) {
        result[i] = spi->dev->data_buf[i];
      }
    }
    if (data) {
      data += c_longs;
    }
    if (result) {
      result += c_longs;
    }
    longs -= c_longs;
    len -= c_len;
  }
}

void espiTransferBitsNL(espi_t *spi, uint32_t data, uint32_t *out,
                       uint8_t bits) {
  if (!spi) {
    return;
  }

  if (bits > 32) {
    bits = 32;
  }
  uint32_t bytes = (bits + 7) / 8; // 64 max
  uint32_t mask = (((uint64_t)1 << bits) - 1) & 0xFFFFFFFF;
  data = data & mask;
  if (!spi->dev->ctrl.wr_bit_order) {
    if (bytes == 2) {
      MSB_16_SET(data, data);
    } else if (bytes == 3) {
      MSB_24_SET(data, data);
    } else {
      MSB_32_SET(data, data);
    }
  }

  spi->dev->mosi_dlen.usr_mosi_dbitlen = (bits - 1);
  spi->dev->miso_dlen.usr_miso_dbitlen = (bits - 1);
  spi->dev->data_buf[0] = data;
  spi->dev->cmd.usr = 1;
  while (spi->dev->cmd.usr)
    ;
  data = spi->dev->data_buf[0];
  if (out) {
    *out = data;
    if (!spi->dev->ctrl.rd_bit_order) {
      if (bytes == 2) {
        MSB_16_SET(*out, data);
      } else if (bytes == 3) {
        MSB_24_SET(*out, data);
      } else {
        MSB_32_SET(*out, data);
      }
    }
  }
}

void espiWritePixelsNL(espi_t *spi, const void *data_in, size_t len) {
  size_t longs = len >> 2;
  if (len & 3) {
    longs++;
  }
  bool msb = !spi->dev->ctrl.wr_bit_order;
  uint32_t *data = (uint32_t *)data_in;
  size_t c_len = 0, c_longs = 0, l_bytes = 0;

  while (len) {
    c_len = (len > 64) ? 64 : len;
    c_longs = (longs > 16) ? 16 : longs;
    l_bytes = (c_len & 3);

    spi->dev->mosi_dlen.usr_mosi_dbitlen = (c_len * 8) - 1;
    spi->dev->miso_dlen.usr_miso_dbitlen = 0;
    for (int i = 0; i < c_longs; i++) {
      if (msb) {
        if (l_bytes && i == (c_longs - 1)) {
          if (l_bytes == 2) {
            MSB_16_SET(spi->dev->data_buf[i], data[i]);
          } else {
            spi->dev->data_buf[i] = data[i] & 0xFF;
          }
        } else {
          MSB_PIX_SET(spi->dev->data_buf[i], data[i]);
        }
      } else {
        spi->dev->data_buf[i] = data[i];
      }
    }
    spi->dev->cmd.usr = 1;
    while (spi->dev->cmd.usr)
      ;

    data += c_longs;
    longs -= c_longs;
    len -= c_len;
  }
}

/*
 * Clock Calculators
 *
 * */

typedef union {
  uint32_t regValue;
  struct {
    unsigned regL : 6;
    unsigned regH : 6;
    unsigned regN : 6;
    unsigned regPre : 13;
    unsigned regEQU : 1;
  };
} spiClk_t;

#define ClkRegToFreq(reg)                                                      \
  (CPU_CLK_FREQ / (((reg)->regPre + 1) * ((reg)->regN + 1)))

uint32_t espiClockDivToFrequency(uint32_t clockDiv) {
  spiClk_t reg = {clockDiv};
  return ClkRegToFreq(&reg);
}

uint32_t espiFrequencyToClockDiv(uint32_t freq) {

  if (freq >= CPU_CLK_FREQ) {
    return SPI_CLK_EQU_SYSCLK;
  }

  const spiClk_t minFreqReg = {0x7FFFF000};
  uint32_t minFreq = ClkRegToFreq((spiClk_t *)&minFreqReg);
  if (freq < minFreq) {
    return minFreqReg.regValue;
  }

  uint8_t calN = 1;
  spiClk_t bestReg = {0};
  int32_t bestFreq = 0;

  while (calN <= 0x3F) {
    spiClk_t reg = {0};
    int32_t calFreq;
    int32_t calPre;
    int8_t calPreVari = -2;

    reg.regN = calN;

    while (calPreVari++ <= 1) {
      calPre = (((CPU_CLK_FREQ / (reg.regN + 1)) / freq) - 1) + calPreVari;
      if (calPre > 0x1FFF) {
        reg.regPre = 0x1FFF;
      } else if (calPre <= 0) {
        reg.regPre = 0;
      } else {
        reg.regPre = calPre;
      }
      reg.regL = ((reg.regN + 1) / 2);
      calFreq = ClkRegToFreq(&reg);
      if (calFreq == (int32_t)freq) {
        memcpy(&bestReg, &reg, sizeof(bestReg));
        break;
      } else if (calFreq < (int32_t)freq) {
        if (abs(freq - calFreq) < abs(freq - bestFreq)) {
          bestFreq = calFreq;
          memcpy(&bestReg, &reg, sizeof(bestReg));
        }
      }
    }
    if (calFreq == (int32_t)freq) {
      break;
    }
    calN++;
  }
  return bestReg.regValue;
}
